Repository: advancedresearch/lojban
Catalog: assets/en-jbo.tmx
Source language: en
Languages: jbo

source: We have two ears.
jbo: re da kerlo ma'a

source: All men must die.
jbo: ro prenu cu mrobi'o

source: Man is mortal.
jbo: ro prenu cu mrodimna

source: A man must work.
jbo: lo nanmu cu nitcu lo ka gunka

source: Man is the only animal that can use fire.
jbo: lo remna cu selte'i lo ka pilno lo fagri kei lo danlo

source: Human beings are different from animals in that they can think and speak.
jbo: lo prenu cu frica lo danlu lo ka kakne lo nu pensi je cusku

source: There is more in life than meets the eye.
jbo: lo pu'u lifri cu zmadu le selvi'a

source: He kept silent all the time during the interrogation.
jbo: ko'a smaji ca'o ru'i le nu retsku

source: Let me explain it with a diagram.
jbo: .e'u mi ciksi sepi'o lo cartu

source: Talking in the library is not allowed.
jbo: na curmi lonu bacru di'o le ckuzda

source: We must not speak in the library.
jbo: ma'a bilga lo nu na bacru ne'i lo ckusro

source: That's it.
jbo: ta co'e

source: Math is the last subject that I want to study.
jbo: lo cmaci cu ro moi lo'i tercu'e poi mi tadni djica

source: When will the world come to an end?
jbo: ca ma lo munje cu selfa'o

source: It's nice.
jbo: pluka

source: Honesty does not always pay. Such is the way of the world.
jbo: .i lo nu stace na roroi te prali .i tcaci zo'e ne lo munje

source: All living things die some day.
jbo: ro jmive cu mrobi'o ca da

source: The students seem to be sleepy today.
jbo: lo tadni cu simlu lo ka sipna ca lo cabdei

source: No students could answer the question.
jbo: no tadni pu ka'e spuda lo preti

source: Formerly this building was a hospital.
jbo: lo ti dinju cu pu spita

source: I used to drink beer.
jbo: mi pu ta'e pinxe lo birje

source: There used to be a lot of fish in any river in Japan.
jbo: so'i finpe ba'o nenri ro rirxe be lo ponjo

source: Why is the baby crying?
jbo: le cifnu cu klaku mu'i ma

source: The baby smiled at me.
jbo: lo cifnu cu cisma ga'a mi

source: The baby was quiet all night.
jbo: lo cifnu cu smaji ze'e lo nicte

source: You can stay here till the snow stops.
jbo: e'u do stali ti co'u lo nu na snime carvi

source: The snow will soon disappear.
jbo: lo snime bazi canci

source: My family went to the zoo to see pandas last Sunday.
jbo: le mi lanzu cu pu klama lo mivdalmuzga mu'i lo ka viska lo cionmau kei ca lo prulamkemyzeldei

source: You must pay attention to the teacher.
jbo: do bilga lo nu jundi lo ctuca

source: The teacher suggested that we go to the library to study.
jbo: le ctuca cu stidi lonu mi'a klama le ckuzda tezu'e lonu cilre

source: The teacher took notice of the student's mistake.
jbo: lo ctuca cu ganse lo selsre be lo tadni

source: The teacher asked me a difficult question.
jbo: lo ctuca pu retsku lo nandu preti mi

source: Our teacher said to us, "Don't leave the room."
jbo: lo mi'a ctuca cu cusku fi mi'a fe lu ko na cliva lo kumfa li'u

source: They were unanimous that the war should be brought to a halt.
jbo: ro ra tugni lo du'u bilga lo nu sisti lo nu jamna

source: It needs washing.
jbo: lumci be'u ti

source: Thanks in advance.
jbo: mi ckire fi lo ka balvi

source: The former is better than the latter.
jbo: la'e le lidne cu xagmau la'e le se lidne

source: I'm so happy for you.
jbo: uidaisai

source: You can teach good manners to children without resorting to punishment.
jbo: ka'e ctuca lo verba lo du'u xamgu tarti kei ta'i lo nu na sfasa

source: They say Zen cultivates our mind.
jbo: ti'e la .zen. cu ferti lo menli

source: Come home early.
jbo: ko clira klama lo zdani

source: Please open the window.
jbo: .i .e'o ko kargau lo canko

source: Don't open the window.
jbo: ko na kargau lo canko

source: How about running?
jbo: e'u bajra

source: Don't run, walk slowly.
jbo: ko na bajra .i ko masno cadzu

source: Some runners drink water as they are running.
jbo: so'o bajra cu pinxe lo djacu ca'o lonu bajra

source: You cannot lose.
jbo: do na kakne lo nu toljinga

source: Without the sun, we couldn't live on the earth.
jbo: va'o lo nu lo solri na zvati kei na ka'e jmive bu'u le terdi

source: My eyes are dazzled by the sun.
jbo: le mi kanla cu na viska ri'a le solri

source: The sun is so distant from the earth.
jbo: lo solri cu mutce darno lo terdi

source: The sun was shining brightly.
jbo: le solri pu te gusni fi lo carmi

source: Taro, dinner's ready!
jbo: doi taros lo ctesai cu bredi

source: Taro's and Hanako's desk is small.
jbo: lo bijyjbu pe la .taros. jo'u la .xanakos. cmalu

source: The body quickly adjusts itself to changes in temperature.
jbo: lo'e mivyxadni ku sutra tikygau tu'a vo'a seja'e lo nilgla nuncenba

source: There is a little money in the bag.
jbo: jdini sela'u li so'u ne'i lo dakli

source: How will you travel to Osaka?
jbo: fo ma do klama la .osakas.

source: How long have you been staying in Osaka?
jbo: ma ditcu lo nu do stali la.osakan.

source: He lives in Osaka.
jbo: ra xabju la.osakan.

source: You can rely on me.
jbo: .e'e do lacri mi

source: Are you all right?
jbo: .uu.oipei

source: The greater part of the guests were foreigners.
jbo: so'e vitke cu fange

source: I'm very sorry.
jbo: .u'usai

source: The escaped robber is still at large.
jbo: le rivbi zerle'a cu pujeca na'e sispe'i

source: Somebody touched me.
jbo: da pu pencu mi

source: Somebody pushed me in.
jbo: da pu catke mi mo'ine'i

source: Someone robbed Mary of her money.
jbo: da zerle'a loi jdini la .meris.

source: Who can do this work?
jbo: ma kakne lo ka gunka da bi'unai

source: Who did it?
jbo: ma co'e

source: I forget who said it.
jbo: .i mi tolmo'i lo cusku be ko'a

source: I wonder who invented it.
jbo: mi pensi lo du'u makau finti

source: Who stole the apple?
jbo: ma pu zerle'a lo plise

source: Who built it?
jbo: ma zbasu ra

source: Do you know who made it?
jbo: xu do djuno lo nu makau gasnu tu'a ti

source: Who threw a stone at my dog?
jbo: ma renro lo rokci lo mi gerku

source: Everyone's saying it.
jbo: lo ro prenu cu cusku la'e di'u

source: Everybody tends to be lazy.
jbo: sei cumki ro da xo'eroi lazni

source: The explorers discovered a skeleton in the cave.
jbo: lei fakli'u cu facki lo bogygreku ne'i le kevna

source: A baby boy was born to them.
jbo: lo nanla cifnu cu jbena ko'a

source: The man was hiding in a dense forest.
jbo: le nanmu cu pu mipri vo'a ne'i lo denmi ricfoi

source: Didn't you know that?
jbo: xu do pu na djuno la'e di'u

source: The earth rotates.
jbo: la terdi cu carna

source: Is there life on other worlds?
jbo: xu da jmive bu'u lo drata terdi

source: The pond was encircled with trees.
jbo: lo lalxu cu se jinsru lo tricu

source: Please excuse my being late.
jbo: e'o ko zanru lo nu tu'a mi lerci

source: Don't be late.
jbo: ko na jai lerci

source: Who is the woman in the brown coat?
jbo: lo ninmu poi dasni lo bunre kosta cu mo

source: You can use my car as long as you drive it carefully.
jbo: curmi lonu do pilno le mi karce kei lonu do sazri co jundi

source: A car in the parking lot is on fire.
jbo: lo karce bu'u lo ma'ersrostu ca jelca

source: People in the town came to help him.
jbo: loi prenu pe lo tcadu cu klama mu'i lo nu sidju ra

source: Birds were singing among the trees.
jbo: loi cipni pu ca'o sanga sei jbini loi tricu

source: Birds fly.
jbo: loi cipni cu vofli

source: Naoko is a fast runner.
jbo: la naokos. pu'i sutra bajra

source: My brother would often stay up all night reading novels.
jbo: lo mi bruna goi ko'a cu pu ta'e cikna ca lo nicte .imu'ibo ko'a tcidu lo brafi'a

source: The enemy attacked the town.
jbo: lo bradi pu gunta lo tcadu

source: Iron is hard.
jbo: lo'e tirse cu jdari

source: According to the weather report, it will snow tonight.
jbo: du'o le timnoi cu snime ca lo cabycte

source: A good many of the pictures on exhibition were sold on the opening day.
jbo: piso'i loi pixra poi selja'o cu selve'u ca le pamoi djedi

source: Do you like to live in the country?
jbo: xu do nelci lo nu xabju le gugde

source: The phone is out of order.
jbo: lo fonxa cu spofu

source: Please forgive me for forgetting to call you.
jbo: e'o ko fraxu mi lo nu tolmorji lo nu tavla do

source: The telephone was invented by Bell.
jbo: lo fonxa ku pu se finti la .bel.

source: I heard that the distance between Tokyo and Osaka is about 10 km.
jbo: ti'e lo ji'i pano se mitre cu lutnilcla fi la .tokios. la .osakas.

source: In comparison with Tokyo, London is small.
jbo: fi la.tokion. fa la.lyndyn. cmalu

source: Tokyo is a big city.
jbo: la .tokios. cu barda tcadu

source: Tokyo is the capital of Japan.
jbo: la.tokion. raltca lo gugdejupu

source: The lights have been burning all night.
jbo: lei tergu'i cu ru'i gusydi'e ca'o le nicte

source: It tends to rain here a lot in the summer.
jbo: sei lakne vi carvi de'i lo crisa

source: He will be waiting for you when you get there.
jbo: ra denpa ca lo nu do co'a zvati

source: I'm confused.
jbo: mi se cfipu

source: I'll show you the way.
jbo: mi ba zganygau do lo pluta

source: Do you know how to get there?
jbo: xu do djuno lo nu ta'i ma klama ko'a

source: Copper and silver are both metals.
jbo: loi tunka .e loi rijno cu jinme

source: Are you single?
jbo: xu do nu'ospe

source: Do you have any books to read?
jbo: .i xu do ralte lo cukta ku tezu'e loka tcidu

source: Do not cast pearls before swine.
jbo: ko na renro lo jemna vi lo xarju

source: Two boys came running out of the room.
jbo: re nanla pu bajli'a lo nenri be lo kumfa

source: The sun was hot and they were tired.
jbo: zo'ei lo solri pu glare gije za'u ko'a pu tatpi

source: Do you have any Japanese beer?
jbo: xu do ralte lo ponjo birje

source: Japanese children watch television more than English children.
jbo: lo ni lo ponjo verba cu zgana lo veltivni cu zmadu tu'a lo glico verba

source: I'm from Tokyo, Japan.
jbo: mi jbena fo la tokios

source: Japan is an island country.
jbo: lo gugdejupu cu daplu gugde

source: There are many Americans who can speak Japanese.
jbo: so'i merko cu se bangu lo ponjo

source: Do you like Japanese food?
jbo: xu do nelci lo ponjo cidja

source: Do Japanese eat a lot of fish?
jbo: xu lo ponjo prenu cu mutce citka lo finpe

source: The Japanese have dark eyes.
jbo: manku kanla loi ponjo

source: On Sunday, I go to church.
jbo: ca lo nondei mi klama lo malsi

source: Please knock on the door before you enter.
jbo: e'o ko darxi lo vorme ba lo nu co'a nenri

source: You had better enter the hospital.
jbo: e'u ko nerkla lo spita

source: Are you pregnant?
jbo: xu do seltarbi

source: I stood under a tree to avoid getting wet.
jbo: mi klama lo cnita be lo trici mu'i lo nu mi to'e cilmo

source: The cat dug its claws into my hand.
jbo: .i lo mlatu cu zukte co tunta be fa lo jgalu lo mi xance

source: I have a fever.
jbo: mi glabi'a

source: I am eighteen years old.
jbo: mi nanca li pabi

source: Fertile soil is indispensable for agriculture.
jbo: lo ferti dertu cu tcevajni lo nuntumcrepu

source: Basho was the greatest poet.
jbo: la.bacos. pemci'a traji

source: Don't be silly.
jbo: ko na bebna

source: My back still hurts.
jbo: lo bekpi be mi ca'o se cortu

source: There is a connection between smoking and lung cancer.
jbo: lo nu damva'u lo nu se feprykenra cu rinkyra'a

source: Mr Umemura teaches us English.
jbo: la.umemuran. ctuca mi'a fo lo glibau

source: Can you do some shopping for me?
jbo: xu do se ba'i mi ka'e zacterve'u

source: Where is the entrance to the museum?
jbo: ma stuzi lo nerkalri be lo muzga

source: You've got the wrong number.
jbo: do srera tu'a lo fonjudri

source: I think you have the wrong number.
jbo: .ia do fonjudri srera

source: Is he the owner of that car?
jbo: xu ko'a ponse lo va karce

source: He comes back from Sydney today.
jbo: ca lo cabdei ra se'ixru fi la.sidnis.

source: It is strange that he should say so.
jbo: lonu ra cusku la'ede'u cu cizra

source: He is the very person I was talking of.
jbo: ko'a sa'e te se tavla mi

source: I had been reading a letter when he came in.
jbo: ca'o lo nu mi tcidu lo xatra kei ku ko'a klama

source: I never heard him sing.
jbo: mi ze'epu noroi tersa'a fi ko'a

source: It is certain that he will agree with us.
jbo: se birti fa lo du'u ko'a ba tugni ma'a

source: He came to see you yesterday.
jbo: ra klama ca lo prulamdei mu'i lo nu viska do

source: I saw him wash the car.
jbo: sei mi pu viska ko'a lumci lo karce

source: There was a strong likelihood of his succeeding.
jbo: .i lo nu snada cu mutce lakne

source: I admit that he is right.
jbo: i'a ra drani

source: I didn't know he had decided to leave.
jbo: mi na djuno lo nu ra jdice lo nu cliva

source: I expected that he would come.
jbo: mi pu kanpe lo nu ko'a ba klama

source: He and I walked together.
jbo: ra joi mi cadzu

source: He and I are cousins.
jbo: ko'a mi tamne

source: He and I are brothers.
jbo: ko'a je mi bruna

source: He doesn't have the ability to do the work properly.
jbo: ko'a na kakne lo nu drani gunka

source: He has three brothers.
jbo: ci da bruna ra

source: He has three children.
jbo: ci da panzi ra

source: He had three sons who became lawyers.
jbo: pu se bersa ci da noi binxo lo flacre

source: If anything happens to him, let me know.
jbo: fau lo nu ra lifri da cu pinka fi ko mi

source: Will you sell your house to him?
jbo: xu do ba vecnu lo do dinju ko'a

source: I went to see him, but he was out.
jbo: mi klama mu'i lo nu penmi ra .i je ku'i ri na zvati

source: Giving advice to him is like talking to a brick wall.
jbo: lo nu djusku ko'a cu simsa lo nu tavla lo kityblibi'u

source: I can hardly hear him.
jbo: mi ja'aru'e tirna lo se bacru be ko'a

source: His father died after his return home.
jbo: lo ko'a patfu cu mrobi'o ba'o lo nu zdani xruti

source: It is said that his father died in a foreign country.
jbo: ti'e lo ko'a patfu cu mrobi'o ne'i lo fange gugde

source: I hear that his father is abroad.
jbo: ti'e lo patfu be ra cu zvati lo bargu'e

source: He is taller than his brother.
jbo: ra rajyclazma lo bruna be vo'a

source: His argument is rational.
jbo: lo seldau be ra cu racli

source: His talent is green.
jbo: lo ko'a se stati cu crino

source: What he said was far from true.
jbo: le se cusku ku nalje'u mutce

source: His wife is one of my friends.
jbo: lo speni be ra cu pendo mi

source: His sister became a doctor.
jbo: lo ko'a mensi cu binxo lo mikce

source: Pay attention to his advice.
jbo: ko jundi lo ko'a se zukti'i

source: When will his new novel come out?
jbo: ca ma ckupra lo ra cnino brafi'a

source: His life is full of trouble.
jbo: ko'a culno lifri lo raktu

source: He is very blunt in his manner.
jbo: le ko'a skutadji cu nalcni

source: He is always talking big.
jbo: ko'a roroi dukse tavla

source: There were two careless mistakes on his paper.
jbo: ra pu srera re tu'a lo vo'a papri

source: The accident happened because he wasn't careful.
jbo: lo snuti pu se rinka lo nu ko'a na jundi

source: What is his name?
jbo: ma cmene ra

source: His name is very difficult to remember.
jbo: lo nu morji lo cmene be ra cu nandu

source: I have just remembered his name, which I couldn't for a long time.
jbo: mi zi morji lo cmene be ra noi mi ze'a na ka'e morji

source: Do you remember his name?
jbo: xo do morji lo du'u lo me ta cmene ku mokau

source: It is difficult to understand his theory.
jbo: lo nu jimpe fi lo sidbo be fi ra cu nandu

source: He seems happy.
jbo: ra simlu lo ka gleki

source: He kicked it.
jbo: ra pu tikpa ra

source: He speaks English fluently.
jbo: ra filta'a fo lo glico

source: He has a dog.
jbo: ra ralte lo gerku

source: He's a big boy.
jbo: ra barda nanla

source: He studies Chinese.
jbo: ra tadni lo jugbau

source: He is the eldest.
jbo: ra tolci'orai

source: He never speaks unless spoken to.
jbo: ra no roi tavla va'o lo nu na tavla vo'a

source: He said, "I'm from Canada."
jbo: pu cusku lu mi se gugde lo kenedys li'u

source: He is able to speak ten languages.
jbo: pano da zo'u ko'a kakne lonu ce'u se bangu da

source: He did not come back before ten o'clock.
jbo: ra na klama ti pu lo se tcika be li rere

source: He wrote this novel at twenty.
jbo: ra ciska lo vi lisycku ca tu'a lo reno nanca

source: He weighs 270 pounds.
jbo: ko'a bunda li rezeno

source: He is about forty.
jbo: tu'a ra nanca li ji'i vono

source: He promised me that he would come at four.
jbo: pu nupre fi mi fe lo nu vo'a ba klama ti'u li vo

source: He gave me a promise to come here at five.
jbo: ra nupre lo nu klama ti ti'u li mu

source: He looked for them for five hours.
jbo: pu sisku tu'a za'u ta ca'o lo mu cacra

source: He said that it was nine o'clock.
jbo: ra cusku lo se du'u li so tcika

source: He is leaving Chicago tomorrow.
jbo: ra cliva la.cikagos. ca lo bavlamdei

source: He doesn't understand you.
jbo: ra na jimpe fi do

source: Is he a friend of yours?
jbo: xu ra pendo do

source: He drinks too much beer.
jbo: ra dukse pinxe lo birje

source: He was more or less drunk.
jbo: jibni xalbebna

source: He is on the heavy side.
jbo: milxe tilju

source: He collected bits of information.
jbo: pu jajgau lo datni spisa

source: He is a bad boy.
jbo: tolvu'e

source: He rose from his chair to welcome me.
jbo: ko'a narzutse binxo gi'e rinsa mi

source: He sank into a chair.
jbo: ko'a zutse binxo

source: He stood behind the chair.
jbo: ko'a sanli ti'a le stizu

source: I believe he is going to be rich one day.
jbo: mi krici lo du'u ko'a ba binxo lo ricfu

source: He is always happy.
jbo: ra ro roi gleki

source: He is always studying.
jbo: ra ro roi tadni

source: He is always forgetting things.
jbo: ra ro roi tolmo'i da

source: He always tells the truth.
jbo: ra ro roi cusku lo jetnu

source: He's always reading comics.
jbo: ra di'i tcidu fi loi lisxracku

source: When did he go to Europe?
jbo: ca ma ra pu klama la europas

source: He tends to tell lies.
jbo: so'iroi cusku lo jitfa

source: He carried his grandfather on his back.
jbo: ko'a bevri lo ko'a pafpa'u noi ke'a cpana lo ko'a cutyti'e

source: He has no money.
jbo: ko'a ponse no loi jdini

source: He was accused of stealing money.
jbo: zerfuzyxu'a ko'a lo nu zerle'a loi jdini

source: He denied having stolen the money.
jbo: ko'a natfe lo du'u zerle'a loi jdini

source: He was punished for stealing the money.
jbo: sfasa ko'a lo nu zerle'a loi jdini

source: Because he was wealthy, he was able to go there.
jbo: ko'a pu'i klama ki'u lo nu ko'a ricfu

source: He is far from rich.
jbo: ko'a to'e ricfu

source: He is no less smart than his brother.
jbo: ko'a le bruna be ko'a na mleca lo ni mencre

source: He is not as tall as his brother.
jbo: ko'a le bruna be ko'a cu mleca lo ni claselxadni

source: They don't have anything in common at all.
jbo: dunli fi noda

source: He has lost his father's watch.
jbo: ko'a pu cirko lo junla pe lo patfu be ko'a

source: He married a Canadian girl.
jbo: ra speni lo kadno ninmu

source: He is making cookies.
jbo: ra ca zbasu lo titnanba

source: He hates spiders.
jbo: ra xebni lo jukni

source: He was supposed to come.
jbo: ra pu bilga lo nu klama

source: He does not have to do this.
jbo: ra na nitcu lo nu co'e

source: He is a student at this college.
jbo: ra tadni bu'u lo vi ma'urcu'e

source: He can come.
jbo: ko'a ka'e klama

source: He taught us that Columbus discovered America.
jbo: ra pu ctuca mi'a lo du'u la .columbos. pu zatfa'i la bemjoitcotu'a

source: He often drives his father's car.
jbo: ra piso'i roi sazri lo karce pe lo patfu be vo'a

source: He tends to talk too much.
jbo: so'iroi tavla

source: He has gone to Switzerland.
jbo: ra pu klama lo gugdecuxe

source: He is smelling the soup.
jbo: ko'a sumne le stasu

source: He broke his leg skiing.
jbo: lo ko'a tuple pu porpi ri'a lonu ko'a skiji sakli

source: He quickly went out of the room.
jbo: ra sutra cliva lo kumfa

source: He told me not to swim there.
jbo: ra minde mi lo nu na va limna

source: He accurately described what happened there.
jbo: ko'a drani skicu lo fasnu bevi tu

source: He observed many types of creatures there.
jbo: ra va zgana so'i klesi be lo danlu

source: He found it impossible to lift the lid.
jbo: pu facki lo du'u to'e se cumki lo nu lafti lo gacri

source: The experience gave him the courage.
jbo: mu'i tu'a le selyli'i ko'a virnu

source: He succeeded in climbing the mountain.
jbo: ra snada lo nu cpare lo cmana

source: He rescued the child from the fire.
jbo: ra pu nurxru lo verba lo fagri

source: They adopted the little girl.
jbo: ko'a selrircpa le cmalu nixli

source: He is on board the ship.
jbo: ra zvati lo brablo

source: He was pleased to hear the news.
jbo: ko'a se pluka lo nu ko'a ve nuzba

source: He read the story five times over.
jbo: ra tcidu lo va cukta mu roi

source: He is the only person that can do it.
jbo: ta po'o ka'e zukte ti

source: He explained the process of putting them together.
jbo: ko'a ciksi lo pu'u zbasu fi ko'e

source: He likes most beautiful flowers.
jbo: ko'a nelci lo traji melbi xrula

source: He decided to quit smoking.
jbo: ko'a jdice lo du'u fanmo lo nu damva'u

source: He can speak a little English.
jbo: ko'a selbau ru'e lo bangenugu

source: He turned the table upside down.
jbo: ko'a cargau lo jubme ja'e lo nu gapnitfa'e

source: He likes to watch TV.
jbo: ra nelci lo nu zgana lo veltivni

source: He hid it behind the door.
jbo: pu mipri ko'a ta'i lo nu trixygau fi lo vorme

source: He did not know where to go.
jbo: ko'a pu na djuno fi lo nu klama ma kau

source: He can swim very fast.
jbo: ra kakne lo nu mutce sutra limna

source: Although he is very old, he is strong.
jbo: ko'a mutce laldo .i ku'i tsali

source: He jumped out of bed.
jbo: plipe fi lo ckana

source: He's shorter than Tom.
jbo: ra tordu zmadu la.tam.

source: He walked rapidly.
jbo: ko'a pu sutra cadzu

source: He tends to be idle.
jbo: ta'e cando

source: How fast he runs!
jbo: .u'e ra bajra sutra

source: He is eager for success.
jbo: ra campa'a lo nu snada

source: He did not know what to say.
jbo: ra na pu djuno lo ka ka'e cusku makau

source: Does he go to school by bus?
jbo: xu ko'a klama lo ckule fu lo sorprekarce

source: He became a pianist.
jbo: ra pu co'a pipno prenu

source: He was very poor.
jbo: ra pu mutce pindi

source: He has visited France three times.
jbo: ba'o ci roi klama lo fraso

source: Can he speak French?
jbo: xu ra se bangu lo fraso

source: He is loyal to his boss.
jbo: tu'a ko'a na tcica le ko'a jatna

source: He pressed the button and waited.
jbo: ra pu danre lo batke gi'e pu denpa

source: He comes here almost every day.
jbo: ra tolcliva ti ca so'a djedi

source: He came back by way of Honolulu.
jbo: ra pu xrukla fo la .anolulus.

source: He is still very much alive.
jbo: ko'a za'o nejni prenu

source: He is not down yet.
jbo: ra pu'o cnita

source: He is still angry.
jbo: ra za'o fengu

source: They were all surprised to see me there.
jbo: ro lo ra pu se spaji lo ka viska mi va

source: He no longer works here.
jbo: ra ba'o vi gunka

source: He does not live there any more.
jbo: ko'a ba'o vi xabju

source: He talks well.
jbo: ko'a xamgu tavla

source: He had the bad habit of drinking too much wine.
jbo: ra se tcaci lo nu pinxe lo du'e vanju

source: He made out really well in the clothing business.
jbo: ko'a snada tu'a lo taxfu vecnu

source: In addition to being a doctor, he is a writer.
jbo: .i ge mikce gi ji'a tercku

source: He is not a doctor.
jbo: ra na mikce

source: He made up his mind to be a doctor.
jbo: ra jdica lo nu mikce

source: He is alone.
jbo: ra nonkansa

source: He was alone.
jbo: ra pu nonkansa

source: He is dreaming of becoming an astronaut.
jbo: ra ca'o pacna lo ba nu vo'a keskla

source: He is a good swimmer.
jbo: ra xamgu limna

source: He suggested that we go for a swim.
jbo: ra stidi lo nu mi'a limna

source: He is fond of swimming.
jbo: ra nelci lo nu limna

source: English is not easy for him to learn.
jbo: lo nu cilre fi lo bangenugu na frili ra

source: He is busy learning English.
jbo: ko'a zukcfu le nu bancli fi la glibau
